# SetClLSN

## Description
Sets the line style of the specified class.

```pascal
PROCEDURE SetClLSN(
				className : STRING;
				lineStyle : LONGINT);
```

```python
def vs.SetClLSN(className, lineStyle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class.|
|lineStyle|LONGINT|Line style index value.|

## See Also
VS Functions:
GetClLSN

## Version
Availability: from Vectorworks 2013

## Category
* Classes